app/Controllers/Admin.php

SELECT `u`.`pk_user`, `p`.`person`, `p`.`first_name`, `p`.`last_name`
FROM `tbl_users` `u`
JOIN `tbl_persons` `p` ON `p`.`pk_phone` = `u`.`fk_phone`
WHERE `u`.`fk_level` = 2
SELECT `e`.`pk_enrollment`, `e`.`group_name`, `e`.`subject`, `tp`.`person` as `profesor_nombre`, `tp`.`first_name` as `profesor_first`, `tp`.`last_name` as `profesor_last`, `ta`.`person` as `alumno_nombre`, `ta`.`first_name` as `alumno_first`, `ta`.`last_name` as `alumno_last`
FROM `tbl_enrollment` `e`
JOIN `tbl_users` `up` ON `up`.`pk_user`  = `e`.`fk_teacher_user`
JOIN `tbl_persons` `tp` ON `tp`.`pk_phone` = `up`.`fk_phone`
JOIN `tbl_users` `ua` ON `ua`.`pk_user`  = `e`.`fk_student_user`
JOIN `tbl_persons` `ta` ON `ta`.`pk_phone` = `ua`.`fk_phone`
SELECT `u`.`pk_user`, `p`.`person`, `p`.`first_name`, `p`.`last_name`
FROM `tbl_users` `u`
JOIN `tbl_persons` `p` ON `p`.`pk_phone` = `u`.`fk_phone`
WHERE `u`.`fk_level` = 3
SELECT `u`.`pk_user`, `u`.`fk_phone`, `u`.`locked`, `u`.`created_at`, `c`.`level`, `p`.`person`, `p`.`first_name`, `p`.`last_name`, `p`.`telegram_chat_id`
FROM `tbl_users` `u`
JOIN `tbl_persons` `p` ON `p`.`pk_phone` = `u`.`fk_phone`
JOIN `cat_levels` `c` ON `c`.`pk_level` = `u`.`fk_level`
ORDER BY `u`.`created_at` DESC
SELECT `pk_level`, `level`
FROM `cat_levels`
---
    public function index()
    {
        $db = \Config\Database::connect();

        $profesores = $db->table('tbl_users u')
            ->select('u.pk_user, p.person, p.first_name, p.last_name')
            ->join('tbl_persons p', 'p.pk_phone = u.fk_phone')
            ->where('u.fk_level', 2)
            ->get()->getResultArray();

        $alumnos = $db->table('tbl_users u')
            ->select('u.pk_user, p.person, p.first_name, p.last_name')
            ->join('tbl_persons p', 'p.pk_phone = u.fk_phone')
            ->where('u.fk_level', 3)
            ->get()->getResultArray();

        $inscripciones = $db->table('tbl_enrollment e')
            ->select('
                e.pk_enrollment,
                e.group_name,
                e.subject,
                tp.person       as profesor_nombre,
                tp.first_name   as profesor_first,
                tp.last_name    as profesor_last,
                ta.person       as alumno_nombre,
                ta.first_name   as alumno_first,
                ta.last_name    as alumno_last
            ')
            ->join('tbl_users up',  'up.pk_user  = e.fk_teacher_user')
            ->join('tbl_persons tp','tp.pk_phone = up.fk_phone')
            ->join('tbl_users ua',  'ua.pk_user  = e.fk_student_user')
            ->join('tbl_persons ta','ta.pk_phone = ua.fk_phone')
            ->get()->getResultArray();

        $usuarios = $db->table('tbl_users u')
            ->select('
                u.pk_user,
                u.fk_phone,
                u.fk_level,
                u.locked,
                u.created_at,
                c.level,
                p.person,
                p.first_name,
                p.last_name,
                p.telegram_chat_id
            ')
            ->join('tbl_persons p', 'p.pk_phone = u.fk_phone')
            ->join('cat_levels c',  'c.pk_level = u.fk_level')
            ->orderBy('u.created_at', 'DESC')
            ->get()->getResultArray();

        $niveles = $db->table('cat_levels')
            ->select('pk_level, level')
            ->get()->getResultArray();

SELECT *
FROM `tbl_users`
WHERE `pk_user` = '282'
UPDATE `tbl_users` SET `fk_level` = '5', `locked` = '0'
WHERE `pk_user` = '282'
UPDATE `tbl_persons` SET `person` = 'IVáN SOTELO', `first_name` = 'ROSARIO', `last_name` = 'ESPINOSA', `telegram_chat_id` = '7779376191'
WHERE `pk_phone` = '0569610282'
---
    public function updateUser()
    {
        $db       = \Config\Database::connect();
        $pk_user  = $this->request->getPost('pk_user');
        $fk_level = $this->request->getPost('fk_level');
        $locked   = $this->request->getPost('locked');
        $person   = strtoupper($this->request->getPost('person'));
        $first    = strtoupper($this->request->getPost('first_name'));
        $last     = strtoupper($this->request->getPost('last_name'));
        $telegram = $this->request->getPost('telegram_chat_id');

        $user = $db->table('tbl_users')->where('pk_user', $pk_user)->get()->getRowArray();

        if (!$user)
        {
            ob_clean();
            return $this->response->setJSON(['status' => '404', 'message' => 'Usuario no encontrado']);
        }

        $db->table('tbl_users')
            ->where('pk_user', $pk_user)
            ->update([
                'fk_level' => $fk_level,
                'locked'   => $locked,
            ]);

        $db->table('tbl_persons')
            ->where('pk_phone', $user['fk_phone'])
            ->update([
                'person'           => $person,
                'first_name'       => $first,
                'last_name'        => $last,
                'telegram_chat_id' => $telegram ?: null,
            ]);