app/Controllers/Auth.php

SELECT *
FROM `tbl_users`
WHERE `pk_user` = '0490'
 LIMIT 1
---
    public function loginProcess()
    {
        $rules =
        [
            'phone'    => 'required|min_length[10]|numeric',
            'password' => 'required|min_length[3]'
        ];

        if (!$this->validate($rules))
        {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $usersModel = new UsersModel();

        $pk_user  = substr($this->request->getPost('phone'), -4);
        $password = $this->request->getPost('password');

        $user = $usersModel->where('pk_user', $pk_user)->first();