app/Controllers/Levels.php

    public function read()
    {
        $levelsModel = new LevelsModel();

        $cat_levels = $levelsModel->findAll();
---
SELECT *
FROM `cat_levels`